---
kind: type
id: T:Autodesk.Revit.DB.CurtainSystemType
source: html/8fc2105b-e7c7-afc5-5dea-15160cba19a1.htm
---
# Autodesk.Revit.DB.CurtainSystemType

An object that represents CurtainSystem type.

## Syntax (C#)
```csharp
public class CurtainSystemType : HostObjAttributes
```